# vim: syntax=ruby filetype=ruby

# core

brew 'fish'
brew 'neovim'
cask 'kitty'
cask 'firefox'

# containers

brew 'docker'

# database

brew 'redis'
brew 'libpq'

# asdf node deps

brew 'gpg'
brew 'gawk'
brew 'gcc'

# misc. cli tools

brew 'asdf'
brew 'cloc'
brew 'fd'
brew 'fzf'
brew 'jq'
brew 'pre-commit'
brew 'the_silver_searcher'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'mkcert'
brew 'stow'
brew 'xcbeautify'
brew 'sops'
brew 'terraform'
brew 'caddy'

# vendor-specific tools

brew 'gh'
brew 'firebase-cli'

brew 'stripe/stripe-cli/stripe'

tap 'wix/brew'
brew 'wix/brew/applesimutils'
