# vim: syntax=ruby filetype=ruby

# basic brew taps

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'

# core

brew 'fish'
brew 'neovim'
cask 'kitty'
cask 'firefox'

# containers

brew 'docker'
brew 'kustomize'

# database

brew 'redis'
brew 'libpq'
brew 'duckdb'

# asdf node deps

brew 'gpg'
brew 'gawk'
brew 'gcc'

# misc. cli tools

brew 'cloc'
brew 'fd'
brew 'fzf'
brew 'jq'
brew 'mpv'
brew 'mysql'
brew 'nnn'
brew 'pre-commit'
brew 'the_silver_searcher'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'golang-migrate'
brew 'golangci-lint'
brew 'mkcert'
brew 'stow'
brew 'xcbeautify'
brew 'sops'
brew 'graphviz'
brew 'dagger/tap/dagger'
brew 'ansible'
brew 'terraform'
brew 'terraform-ls'
brew 'lua-language-server'
brew 'caddy'
brew 'ansifilter'
brew 'yaml-language-server'

brew 'jesseduffield/lazygit/lazygit'

tap 'tinygo-org/tools'
brew 'tinygo'

# kube

brew 'kubectx'
brew 'argocd'
brew 'helm'
brew 'kubeseal'

# vendor-specific tools

brew 'gh'
brew 'circleci'
brew 'firebase-cli'

tap 'stripe/stripe-cli'
brew 'stripe/stripe-cli/stripe'

tap 'wix/brew'
brew 'wix/brew/applesimutils'

# native development

brew 'cocoapods'
cask 'flipper'
