# vim: syntax=ruby filetype=ruby

# basic brew taps

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'

# core

brew 'fish'
brew 'neovim'
cask 'kitty'
cask 'firefox'

# containers

brew 'docker'
brew 'kubectx'
brew 'kustomize'

# database

brew 'redis'
brew 'libpq'

# asdf node deps

brew 'gpg'
brew 'gawk'

# misc. cli tools

brew 'cloc'
brew 'fd'
brew 'fzf'
brew 'jq'
brew 'mpv'
brew 'mysql'
brew 'nnn'
brew 'pre-commit'
brew 'the_silver_searcher'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'golang-migrate'
brew 'golangci-lint'
brew 'mkcert'
brew 'stow'

# vendor-specific tools

cask 'google-cloud-sdk'
brew 'gh'
brew 'circleci'

tap 'stripe/stripe-cli'
brew 'stripe/stripe-cli/stripe'

tap 'wix/brew'
brew 'wix/brew/applesimutils'

# native development

brew 'cocoapods'
cask 'flipper'

